import React, {Component} from 'react';
import {Container, Nav, Tab, Row, Col, Button, Media, Card, ListGroup} from "react-bootstrap";


export default class Infa extends Component {
    render() {
        return (
           <Container style={{width:'1500px'}} >
               <Tab.Container id="left-tabs-example" defaultActiveKey="first" >
                   <Row >
                       <Col sm={2} >
                           <Nav variant="pills"  className="flex-column mt-3 " style={{ height:'300px'}}>
                               <Nav.Item className="bg-dark " >
                                   <Nav.Link eventKey="first" className="text-light" >При поранені </Nav.Link>
                               </Nav.Item>
                               <Nav.Item className="bg-dark ">
                                   <Nav.Link eventKey="2" className="text-light">При утоплені</Nav.Link>
                               </Nav.Item>
                               <Nav.Item className="bg-dark ">
                                   <Nav.Link eventKey="3" className="text-light">При отруєнні</Nav.Link>
                               </Nav.Item>
                               <Nav.Item className="bg-dark ">
                                   <Nav.Link eventKey="4" className="text-light">При опіках</Nav.Link>
                               </Nav.Item>
                           </Nav>
                       </Col>
                       <Col sm={7} >
                           <Tab.Content   className="mt-3" >
                               <Tab.Pane eventKey="first">
                                   <img width={600}
                                        height={400}
                                        className="m-3"
                                        src="https://fs01.vseosvita.ua/01002jjp-7e90/009.jpg"/>
                                        <p>   У випадку, якщо ви отримали поранення,  спробуйте самі собі перев'язати рану хусткою, рушником, шарфом, шматком тканини.   Надайте допомогу тому, хто поруч з вами, але в більш важкому стані. При пораненні настає кровотеча різної інтенсивності, яку необхідно зупинити.

                                            При артеріальній кровотечі кров яскрава, червона, вихлюпується з артерії фонтаном.  У випадку сильної кровотечі на кисті або передпліччі, необхідно максимально зігнути ліктьовий суглоб; при кровотечі на стопі і гомілки - зігнути ногу в колінному суглобі. При артеріальній кровотечі на стегні - накласти джгут (закрутку) на нозі нижче паху; на плечі - джгут трохи нижче плечового суглоба.

                                            При венозній кровотечі кров витікає рівномірним струменем темного або майже чорного кольору. Для зупинки цієї кровотечі  треба максимально підняти кінцівку і накласти тугу пов'язку. Після зупинки кровотечі краї рани треба змастити розчином йоду або зеленкою, прикрити рану марлевою серветкою або чистою ганчіркою і  забинтувати бинтом, шматком матерії або поясом.

                                            Біль при пораненні може призвести до шокового стану потерпілого. У цьому випадку, крім зупинки кровотечі необхідно: покласти або посадити потерпілого так, щоб його руки і ноги були трохи підняті; використовувати знеболюючі засоби; закутати потерпілого, щоб забезпечити максимальне тепло.

                                            При наданні першої допомоги у випадках поранення категорично не можна:

                                            - промивати рану;
                                            - витягувати будь-які сторонні тіла;
                                            - класти в рану вату, змочену йодом.

                                            В екстрених випадках можна просто взяти шматок чистої матерії (носовичок, шматок сорочки і т. д.), покласти його в рану і міцно притиснути рукою, тримаючи так  протягом часу транспортування до лікувального закладу.</p>
                               </Tab.Pane>
                               <Tab.Pane eventKey="2">
                                   <img width={600}
                                        height={400}
                                        className="m-3"
                                       src="https://burshtyn-rada.if.gov.ua/wp-content/uploads/2018/08/unnamed-1.jpg"/>
                                   <p>ПЕРША ДОПОМОГА ПРИ УТОПЛЕННІ
                                       Перш за все, постраждалого необхідно якнайшвидше доставити до берега та викликати екстрену допомогу - 103.

                                       Зверніть увагу, що надавати першу допомогу у воді може лише досвідчений рятувальник. Не намагайтесь витягти людину з води, якщо небезпека може загрожувати і вам.

                                       Очистіть ротову порожнину потерпілого від піску та водоростей і переверніть потерпілого, аби вода витекла з верхніх дихальних шляхів (дітей тримають за ноги, головою донизу).

                                       Якщо людина не дихає, починайте штучне дихання: затисніть потерпілому носа, вдихніть повітря та видихніть в рот потерпілому. Повторюйте процедуру з інтервалом в 4 -5 секунд. Маленьким дітям штучне дихання роблять, одночасно вдуваючи повітря в рот та ніс.

                                       Якщо відсутнє серцебиття, починайте робити непрямий масаж серця:

                                       Покладіть потерпілого на рівну, тверду поверхню;
                                       Покладіть свої долоні (одна на одну) на груди потерпілому;
                                       Випряміть руки в ліктях і всією своєю вагою натисніть на неї;
                                       Зробіть не менше 30 натискань, тривалість кожного близько 1 секунди.
                                       Коли потерпілий прийшов до тями, його слід зігріти: закутайте його в ковдру, за можливості дайте теплий солодкий чай.

                                       Обов’язково дочекайтесь медиків! Ускладнення від утоплення можуть бути відкладеними і проявитися не відразу.

                                       Будьте пильними, бережіть себе та дітей!</p>
                               </Tab.Pane>
                               <Tab.Pane eventKey="3">
                                   <img width={600}
                                        height={400}
                                        className="m-3"
                                        src="https://phc.org.ua/sites/default/files/users/user92/inf_MUSHROOMS_1600x1200_rgb_72dpi%20(1).png"/>
                                   <p>Перша допомога у разі отруєння грибами

                                       терміново телефонуйте до «швидкої» — загальний номер 103;
                                       промийте шлунок простою водою;
                                       дотримуйтеся постільного режиму;
                                       пийте багато рідини (вода, підсолена вода чи прохолодний чай) — це допоможе відновити водно-сольовий баланс та вивести токсини;
                                       прийміть сорбенти.
                                       Категорично заборонено вживати алкогольні напої, будь-яку їжу чи молочні та кисломолочні продукти — це може прискорити всмоктування токсинів у організм.</p>
                               </Tab.Pane>
                               <Tab.Pane eventKey="4">
                                   <img width={600}
                                        height={400}
                                        className="m-3"
                                       src="https://lh3.googleusercontent.com/proxy/8VYPtetT1QUy9v7oShRjow1EJnRSkRy_hUnNULso4kjhNtQfTd4VSVuj5iYmFQfgCYTuM2Fb56gMW8BDcLy10wMHwFxorzNtPkxLZvGUUHhTXk2f4aR-hjOcuN29axXmzO8nkQ5qwI4oYk7kenNQ"/>
                                   <p>Перша допомога при опіках у дітей:
                                       При термічному опіку (опік полум'ям, гарячою рідиною, парою) необхідно відразу ж припинити гарячий вплив на шкіру. Відразу ж зрізуйте гарячий одяг. Протягом наступних 5-15 хвилин необхідно охолодити постраждалу частину шкіри, підставивши її під струмінь холодної води, прикласти лід.
                                       Такі заходи полегшать біль і зупинять поразку більш глибоких шарів шкіри. Робити так потрібно протягом двох годин після опіку. Потім потрібно прийняти знеболювальні та викликати лікаря.
                                       Якщо опік досить важкий, поки чекаєте «швидку» накладіть суху стерильну пов'язку на область поразки і забезпечте потерпілому повний спокій. Якщо у малюка шок, укладіть його та підніміть ноги на 30-40 сантиметрів.
                                       При хімічному опіку (дитина випила нашатирного спирту або спробувала хімічний побутовий засіб) негайно викликайте «швидку допомогу». При таких опіках самостійне лікування може бути дуже небезпечним.
                                       Навіть не намагайтесь давати дитині нейтралізуючі речовини, викликати блювоту. Також не треба давати йому знеболювальне в таблетках - краще зробіть ін'єкцію або ставте свічку.
                                       При електричному опіку (струмом) негайно припиніть вплив струму. Робіть це вкрай обережно. Безпосередній дотик до людини, що знаходиться під дією струму, може викликати електричний опік і у вас. Електричний дріт можна відвести сухою тканиною, палицею або шматком гуми.
                                       Після такої маніпуляції потрібно переконатися, що у потерпілого не порушені дихальні функції. В іншому випадку необхідні заходи термінової реанімації - непрямий масаж серця, штучне дихання. На місце такого опіку накладіть суху стерильну пов'язку.</p>
                               </Tab.Pane>

                           </Tab.Content>

                       </Col>
                       <Col md="3">
                           <h5 className="text-center" mt-3>Наші спеціалісти:</h5>
                           <Card>
                               <ListGroup variant="flush">
                                   <ListGroup.Item>Леонід Сергійович Липа
                                       <p>(головний лікар)</p>
                                   <p>+38099738472</p></ListGroup.Item>
                                   <ListGroup.Item>Денис Ельдарович Сорока
                                       <p>(фармацефт)</p>
                                       <p>+38063353535</p></ListGroup.Item>
                                   <ListGroup.Item>Галина Сименівна Галушка <p>(лаборант)</p>
                                       <p>+38097511313</p></ListGroup.Item>
                               </ListGroup>
                           </Card>

                           <Card className="mt-3" bg="light">
                               <Card.Body>
                                   <Card.Title>Номер швидкої допомоги</Card.Title>
                                   <Card.Text style={{fontSize: 64}}>
                                       103
                                   </Card.Text>
                               </Card.Body>
                           </Card>
                       </Col>
                   </Row>
               </Tab.Container>
           </Container>
        )
    }
}
